<a href="https://colab.research.google.com/github/mkjubran/IntroToPython-NonIT/blob/main/PandasBasics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Basics
By the end of this tutorial, you will be able to:

-       Create, read and store data using Pandas

-       Manipulate data using Pandas

# Pandas DataFrames

Pandas is a high-level data manipulation tool. Its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

Let us start this tutorial by importing the pandas library.

In [1]:
## importing the pandas library
import pandas as pd

We also need to clone some files to be used in the tutorial.

In [2]:
!rm -rf ./MachineLearning
!git clone https://github.com/mkjubran/MachineLearning.git

Cloning into 'MachineLearning'...
remote: Enumerating objects: 7, done.
remote: Counting objects: 100% (7/7), done.
remote: Compressing objects: 100% (6/6), done.
remote: Total 257 (delta 1), reused 6 (delta 1), pack-reused 250
Receiving objects: 100% (257/257), 72.83 MiB | 27.55 MiB/s, done.
Resolving deltas: 100% (116/116), done.

## Creating DataFrames using Dictionary
There are several ways to create a DataFrame. One way way is to use a dictionary.

In [3]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

print('This is the dictionary data')
print(dict)


brics = pd.DataFrame(dict) ## converting the dictionary data into pandas dataframe


print('\n\nThis is the Pandas DataFrame')
brics

This is the dictionary data
{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'], 'capital': ['Brasilia', 'Moscow', 'New Dehli', 'Beijing', 'Pretoria'], 'area': [8.516, 17.1, 3.286, 9.597, 1.221], 'population': [200.4, 143.5, 1252, 1357, 52.98]}


This is the Pandas DataFrame

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

To display the first 3 lines of a DataFrame we use the DataFrame.head()

In [4]:
brics.head(3)

  country    capital    area  population
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Dehli   3.286      1252.0

To display the last 3 lines of a DataFrame we use the DataFrame.tail()

In [5]:
brics.tail(3)

        country    capital   area  population
2         India  New Dehli  3.286     1252.00
3         China    Beijing  9.597     1357.00
4  South Africa   Pretoria  1.221       52.98

**Exercise 2.1:** Create a DataFrame using dictionary with the following data

Index | First Name | Family Name | Age
--- | --- | --- | ---
1| Ammar | Saleem | 22
2| Amer | Saleem | 17
3| Laila | Saleem | 12
4| Salwa | Emran | 19
5| Eman | Emran | 15
6| Noor | Osama | 10
7| Nizar | Osama | 17

In [ ]:
## Write your code here

##Creating DataFrames using Series

Another way is by creating Dataframe from Series.

Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index. [2]

In [6]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]
population = [200.4, 143.5, 1252, 1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics = pd.DataFrame(brics_dict) 
  
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**Exercise 2.2:** Create a DataFrame using series with the following data

Index | First Name | Family Name | Age
--- | --- | --- | ---
1| Ammar | Saleem | 22
2| Amer | Saleem | 17
3| Laila | Saleem | 12
4| Salwa | Emran | 19
5| Eman | Emran | 15
6| Noor | Osama | 10
7| Nizar | Osama | 17

In [ ]:
## Write your code here

## Creating DataFrames by importing .csv files

In another way, a DataFrame can be created by importing a csv file using Pandas.

The "cars.csv" file was cloned using the commands in section "Pandas DataFrames". The csv file  is  stored and can be read using pd.read_csv.

In [8]:
# Import the cars.csv data: cars
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv")

# Print out cars
cars

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

We can also store a DataFrame to a .csv file as follows

In [ ]:
cars.to_csv("./MachineLearning/1_Regression/carprices_new.csv", index = False)

You can view the new "carprices_new.csv" file in the google colab files menu.

**Exercise 2.3:** Write a code to read the data in "Mall_Customers_short.csv" using and display it as pandas DataFrame. This file was cloned to the "./MachineLearning/1_Regression/" folder.

In [ ]:
## Write your code here

**Exercise 2.4:** Write a code to store the DataFrame of Exercise 2.3 into a new csv file.

In [ ]:
## Write your code here

# Indexing and Selecting Data in DataFrames
There are several ways to index and select data in Pandas DataFrame. One of the easiest ways to do this is by using square bracket notation.

In the example below, you can use square brackets to select one column of the cars DataFrame. You can either use a single bracket or a double bracket. The single bracket with output a Pandas Series, while a double bracket will output a Pandas DataFrame.

Print out Mileage column as Pandas Series

In [9]:
# Read cars.csv
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv", index_col = 0)

# Print out Mileage column as Pandas Series
x=cars['Mileage']
print(type(x))
cars['Mileage']

<class 'pandas.core.series.Series'>

Car Model
BMW X5                   69000
BMW X5                   35000
BMW X5                   57000
BMW X5                   22500
BMW X5                   46000
Audi A5                  59000
Audi A5                  52000
Audi A5                  72000
Audi A5                  91000
Mercedez Benz C class    67000
Mercedez Benz C class    83000
Mercedez Benz C class    79000
Mercedez Benz C class    59000
Name: Mileage, dtype: int64

 Print out Sell Price($) column as Pandas DataFrame

In [ ]:
# Print out Sell Price($) column as Pandas DataFrame
x=cars[['Sell Price($)']]
print(type(x))
cars[['Sell Price($)']]

<class 'pandas.core.frame.DataFrame'>

                       Sell Price($)
Car Model
BMW X5                         18000
BMW X5                         34000
BMW X5                         26100
BMW X5                         40000
BMW X5                         31500
Audi A5                        29400
Audi A5                        32000
Audi A5                        19300
Audi A5                        12000
Mercedez Benz C class          22000
Mercedez Benz C class          20000
Mercedez Benz C class          21000
Mercedez Benz C class          33000

Print out DataFrame with Mileage and Sell Price($) columns

In [10]:
# Print out DataFrame with Mileage and Sell Price($) columns
cars[['Mileage', 'Age(yrs)']]

                       Mileage  Age(yrs)
Car Model
BMW X5                   69000         6
BMW X5                   35000         3
BMW X5                   57000         5
BMW X5                   22500         2
BMW X5                   46000         4
Audi A5                  59000         5
Audi A5                  52000         5
Audi A5                  72000         6
Audi A5                  91000         8
Mercedez Benz C class    67000         6
Mercedez Benz C class    83000         7
Mercedez Benz C class    79000         7
Mercedez Benz C class    59000         5

Square brackets can also be used to access observations (rows) from a DataFrame

**Exercise 2.5:** Display the "Annual Income (K)" column in the DataFrame of Exercise 2.3.

In [ ]:
## Write your code here

Print out first 4 observations of the cars DataFrame

In [ ]:
# Print out first 4 observations
cars[0:4]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       69000          18000         6
BMW X5       35000          34000         3
BMW X5       57000          26100         5
BMW X5       22500          40000         2

Print out fifth and sixth observation

In [17]:
# Print out fifth and sixth observation
cars[4:6]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       46000          31500         4
Audi A5      59000          29400         5

**Exercise 2.6:** Display the fifth to the 12th observations of the DataFrame of Exercise 2.3.

In [ ]:
## Write your code here

You can also use loc and iloc to perform just about any data selection operation. iloc is integer index based, so you have to specify rows and columns by their integer index like you did in the previous exercise. loc is label-based, which means that you have to specify rows and columns based on their row and column labels.

Print out observation for the car in the fifth and sixth rows

In [18]:
# Print out observation for the car in the third row 
cars.iloc[4:6]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       46000          31500         4
Audi A5      59000          29400         5

Print out observations for BMW X5 and Audi A5

In [19]:
# Print out observations for BMW X5 and Audi A5
cars.loc[['BMW X5', 'Audi A5']]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       69000          18000         6
BMW X5       35000          34000         3
BMW X5       57000          26100         5
BMW X5       22500          40000         2
BMW X5       46000          31500         4
Audi A5      59000          29400         5
Audi A5      52000          32000         5
Audi A5      72000          19300         6
Audi A5      91000          12000         8

Print out observations for new cars (age less than 5 years)

In [20]:
# Print out observations for new cars
cars.loc[cars['Age(yrs)']<5]

           Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5       35000          34000         3
BMW X5       22500          40000         2
BMW X5       46000          31500         4

We could also display the filter

In [27]:
# Print out observations for new cars
filter = cars['Age(yrs)']<5
print(filter)

Car Model
BMW X5                   False
BMW X5                    True
BMW X5                   False
BMW X5                    True
BMW X5                    True
Audi A5                  False
Audi A5                  False
Audi A5                  False
Audi A5                  False
Mercedez Benz C class    False
Mercedez Benz C class    False
Mercedez Benz C class    False
Mercedez Benz C class    False
Name: Age(yrs), dtype: bool

In another method, we can use the "DataFrame.where()" to locate rows with specific conditions.

In [26]:
New_Cars=cars.where(filter)
New_Cars

                       Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5                     NaN            NaN       NaN
BMW X5                 35000.0        34000.0       3.0
BMW X5                     NaN            NaN       NaN
BMW X5                 22500.0        40000.0       2.0
BMW X5                 46000.0        31500.0       4.0
Audi A5                    NaN            NaN       NaN
Audi A5                    NaN            NaN       NaN
Audi A5                    NaN            NaN       NaN
Audi A5                    NaN            NaN       NaN
Mercedez Benz C class      NaN            NaN       NaN
Mercedez Benz C class      NaN            NaN       NaN
Mercedez Benz C class      NaN            NaN       NaN
Mercedez Benz C class      NaN            NaN       NaN

As shown in the output image, every row which doesn’t have Age(yrs) < 5 is replaced with NaN.

**Exercise 2.7:** Display the observations that correspond to "Spendings" equal 11 in DataFrame of Exercise 2.3 using loc.

In [23]:
## Write your code here

**Exercise 2.8:** Display the observations that correspond to "Spendings" greater than 11 in DataFrame of Exercise 2.3 using DataFrame.where() command.

In [24]:
## Write your code here

# Manipulating DataFrames
There are different ways to manipulate data within DataFrames.

##Adding new column to existing DataFrame

To add a new column to an existing DataFrame, create the list with the values of the new column and add it to the DataFrame as follows:

In [28]:
## Creating the "brics_country_capital_area" DataFrame
country = ["Brazil", "Russia", "India"] 
capital = ["Brasilia", "Moscow", "New Dehli"]
area = [8.516, 17.10, 3.286]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 

brics_brics = { 'country': country_series, 'capital': capital_series, 'area': area_series} 
brics_brics = pd.DataFrame(brics_brics) 
brics_brics

  country    capital    area
0  Brazil   Brasilia   8.516
1  Russia     Moscow  17.100
2   India  New Dehli   3.286

In [29]:
## add the column values to a list
population = [200.4, 143.5, 1252]
brics_brics['population']=population
brics_brics

  country    capital    area  population
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Dehli   3.286      1252.0

## Creating a Pandas dataframe column based on a given condition
While operating on data, there could be instances where we would like to add a column based on some condition.

%% Method #1:

Assume we want to add a column called "population greater than 1000" which equals one if the population of the country is more than 1000M. Otherwise, it equals 0.

In [31]:
# Add a new column named 'Price' 
brics_brics['population greater than 1000'] = [1 if x > 1000 else 0 for x in brics_brics['population']] 

'''
# just to explain the for and if statments in "[1 if x > 1000 else 0 for x in brics_brics['population']]"
for x in brics_brics['population']:
    if x > 1000:
      1
    else:
     0
'''
  
# Print the DataFrame 
brics_brics

  country    capital    area  population  population greater than 1000
0  Brazil   Brasilia   8.516       200.4                             0
1  Russia     Moscow  17.100       143.5                             0
2   India  New Dehli   3.286      1252.0                             1

Assume also, we want to add a column called "density" which equals one if the population devided by the area is less than 100. Otherwise, it equals 0.

In [33]:
# Add a new column named 'Price' 
brics_brics['desnity'] = [1 if x > 10 else 0 for x in brics_brics['population']/brics_brics['area']] 

'''
# just to explain the for and if statments in "[1 if x > 10 else 0 for x in brics_brics['population']/brics_brics['area']] "
for x in brics_brics['population']/brics_brics['area']:
    if x > 10:
      1
    else:
     0
'''

brics_brics

  country    capital    area  population  population greater than 1000  desnity
0  Brazil   Brasilia   8.516       200.4                             0        1
1  Russia     Moscow  17.100       143.5                             0        0
2   India  New Dehli   3.286      1252.0                             1        1

**Exercise 2.9:** Write a code to read the data in "FamilyCitySpendings.csv" using and display it as pandas DataFrame. This file was cloned to the "./MachineLearning/1_Regression/" folder. Create a new DataFrame called "Family" which includes all the fields in the original DataFrame and a new column represent the addition of working and kids family members.

In [ ]:
## Write your code here

%% Method #2:

Assume we have an Employees DataFrame, which includes the names of the employee, the department where he/she works, and their salary.

In [ ]:
# Creating the dataframe 
Employees = pd.DataFrame({'Employee' : ['AA','BB', 'CC','DD','EE','FF'],
                'Department': ['Financial','Management','Technichal','Technichal','Management','Technichal'],
                'Salary' :[1200,1000,1000,1300,1100,900]}) 
Employees

  Employee  Department  Salary
0       AA   Financial    1200
1       BB  Management    1000
2       CC  Technichal    1000
3       DD  Technichal    1300
4       EE  Management    1100
5       FF  Technichal     900

Assume you want to offer them a raise depending on the department they work in. We will define a dictionary of this raise factor and apply it as follows:

In [ ]:
# Create the dictionary 
raise_factor ={'Financial' : 0.1, 'Management' : 0.15, 'Technichal' : 0.2} 
  
# Add a new column named 'Price' 
Employees['Raise Factor'] = Employees['Department'].map(raise_factor) 
  
# Print the DataFrame 
Employees

  Employee  Department  Salary  Raise Factor
0       AA   Financial    1200          0.10
1       BB  Management    1000          0.15
2       CC  Technichal    1000          0.20
3       DD  Technichal    1300          0.20
4       EE  Management    1100          0.15
5       FF  Technichal     900          0.20

Now the new salary will be as follows:

In [ ]:
# Add a new column named 'Price' 
Employees['New Salary'] = Employees['Salary']*(Employees['Raise Factor']+1)
  
# Print the DataFrame 
Employees

  Employee  Department  Salary  Raise Factor  New Salary
0       AA   Financial    1200          0.10      1320.0
1       BB  Management    1000          0.15      1150.0
2       CC  Technichal    1000          0.20      1200.0
3       DD  Technichal    1300          0.20      1560.0
4       EE  Management    1100          0.15      1265.0
5       FF  Technichal     900          0.20      1080.0

**Exercise 2.10:** In the original DataFrame of Exercise 2.9, add a column that provides a numaric code for each City.

In [ ]:
## Write your code here

##Splitting DataFrames into Groups
Pandas DataFrames can be split on any of their axes

In [ ]:
Employees_grouped = Employees.groupby('Department')
Employees_grouped

To display the items for a specific goup, use the get_group() as folows

In [ ]:
Employees_grouped.get_group('Technichal')

  Employee  Department  Salary  Raise Factor  New Salary
2       CC  Technichal    1000           0.2      1200.0
3       DD  Technichal    1300           0.2      1560.0
5       FF  Technichal     900           0.2      1080.0

To display the number of groups

In [ ]:
len(Employees_grouped)

3

**Exercise 2.11:** In the original DataFrame of Exercise 2.9, group the rows by the City. Then display the number of groups and the items in each group.

In [ ]:
## Write your code here

**Exercise 2.12:** For the original DataFrame of exercise 2.9, store the rows that corresponds to Jerusalem City into a separate DataFrame "Family_Jerusalem" and the other Cities into a different DataFrame "Family_Others".

In [ ]:
## Write your code here

**Exercise 2.13:** For the "Family_Jerusalem" DataFrame of exercise 2.12, split the DataFrame such that the City, Annual Income, Working, and Kids in a "Family_Jerusalem_Income" DataFrame and the City, Working, Kids, and Spendings in "Family_Jerusalem_Spendengs" DataFrame. Display each of these DataFrames.

In [ ]:
## Write your code here

## Combine Two DataFrames Vertically 
Combining multiple DataFrames can happen in a different format. This includes vertical concatenation, horizontal concatenation, and merging.

Let us start with vertical concatenation. Assume you have two DataFrames; brics_1 and brics_2. Each of these DataFrames includes a list of some countries and the capital and area of each country.

In [ ]:
## brics_1 DataFrame

## creating lists
country = ["Brazil", "Russia", "India"] 
capital = ["Brasilia", "Moscow", "New Dehli"]
area = [8.516, 17.10, 3.286]
population = [200.4, 143.5, 1252]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics_1 = pd.DataFrame(brics_dict) 
brics_1

  country    capital    area  population
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Dehli   3.286      1252.0

In [ ]:
## brics_1 DataFrame

## creating lists
country = ["China", "South Africa"] 
capital = ["Beijing", "Pretoria"]
area = [9.597, 1.221]
population = [1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series, 'population': population_series} 
  
brics_2 = pd.DataFrame(brics_dict) 
brics_2

        country   capital   area  population
0         China   Beijing  9.597     1357.00
1  South Africa  Pretoria  1.221       52.98

To combine these DataFrames vertically (axis=0), we will use also the Panda concat command.

In [ ]:
brics = pd.concat([brics_1,brics_2],axis=0)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
0         China    Beijing   9.597     1357.00
1  South Africa   Pretoria   1.221       52.98

To ignore the indexing of the concatenated DataFrames and use new indexing, add **ignore_index=True** to the Panda concat command.

In [ ]:
brics = pd.concat([brics_1,brics_2],ignore_index=True, axis=0)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**Exercise 2.14:** Write a code to combine the "Family_Jerusalem" and "Family_Others" DataFrames of exercise 2.12 into a new DataFrame.

In [ ]:
## Write your code here

## Combine Two DataFrames Horizontally 
Assume you have a DataFrame that includes the country and its capital and its area called "brics_capital_area".

In [ ]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series} 
  
brics_capital_area = pd.DataFrame(brics_dict) 
  
brics_capital_area

        country    capital    area
0        Brazil   Brasilia   8.516
1        Russia     Moscow  17.100
2         India  New Dehli   3.286
3         China    Beijing   9.597
4  South Africa   Pretoria   1.221

Assume you have also a DataFrame that includes the country and its population (called "brics_population") in the same order of the previous DataFrame "brics_dict".

In [ ]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
population = [200.4, 143.5, 1252, 1357, 52.98]

## converting lists to pandas series
country_series = pd.Series(country) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'population': population_series} 
  
brics_population = pd.DataFrame(brics_dict) 
  
brics_population

        country  population
0        Brazil      200.40
1        Russia      143.50
2         India     1252.00
3         China     1357.00
4  South Africa       52.98

To combine both DataFrames horizontally (axis=1), use the Panda concat command.

In [ ]:
brics = pd.concat([brics_capital_area,brics_population], axis=1)
brics

        country    capital    area       country  population
0        Brazil   Brasilia   8.516        Brazil      200.40
1        Russia     Moscow  17.100        Russia      143.50
2         India  New Dehli   3.286         India     1252.00
3         China    Beijing   9.597         China     1357.00
4  South Africa   Pretoria   1.221  South Africa       52.98

To include only specific fields in the concatenation, you must index (name) these fields.

In [ ]:
brics = pd.concat([brics_capital_area,brics_population['population']], axis=1)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**Exercise 2.15:** Write a code to combine the "Family_Jerusalem_Income" and "Family_Jerusalem_Spendengs" DataFrames of exercise 2.13 into a new DataFrame.

In [ ]:
## Write your code here

##Merging Two DataFrames

Assume you have a DataFrame that includes the country and its capital (called "brics_capital_area"). You also have a DataFrame that consists of the country and its population (called "brics_population"). You want to combine both DataFrames horizontally. However, You are not sure about the order of both DataFrames.

To create the "brics_capital_area" DataFrame, run the following code

In [ ]:
## creating lists
country = ["Brazil", "Russia", "India", "China", "South Africa"] 
capital = ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.597, 1.221]

## converting lists to pandas series
country_series = pd.Series(country) 
capital_series = pd.Series(capital) 
area_series = pd.Series(area) 

brics_dict = { 'country': country_series, 'capital': capital_series, 'area': area_series} 
  
brics_capital_area = pd.DataFrame(brics_dict) 
  
brics_capital_area

        country    capital    area
0        Brazil   Brasilia   8.516
1        Russia     Moscow  17.100
2         India  New Dehli   3.286
3         China    Beijing   9.597
4  South Africa   Pretoria   1.221

To create the "brics_population" DataFrame, run the following code

In [ ]:
## creating lists
country = ["Russia", "India", "China", "South Africa","Brazil"] 
population = [143.5, 1252, 1357, 52.98,200.4]

## converting lists to pandas series
country_series = pd.Series(country) 
population_series = pd.Series(population) 

brics_dict = { 'country': country_series, 'population': population_series} 
  
brics_population = pd.DataFrame(brics_dict) 
  
brics_population

        country  population
0        Russia      143.50
1         India     1252.00
2         China     1357.00
3  South Africa       52.98
4        Brazil      200.40

To merge the "brics_capital_area" and "brics_population" DataFrames based on the 'country', run the following code

In [ ]:
pd.merge(brics_capital_area, brics_population, on=['country'])

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**Exercise 2.16:** Write a code to combine the "Family_Jerusalem_Income" and "Family_Jerusalem_Spendengs" DataFrames of exercise 2.13 into a new DataFrame.

In [ ]:
## Write your code here

# General Exercises
**Exercise 2.17:** Write a python code to (suggest an exercise based on your data science project)

In [ ]:
## Write your code here

**Exercise 2.18:** Write a python code to (suggest an exercise based on your data science project)

In [ ]:
## Write your code here

# References

The material of this notebook excluding the exercises are selected from \\
[1] pandas tutorial at learnpython.org \\
[2] Geeks for Geeks at https://www.geeksforgeeks.org/python-pandas-series/ \\
[3] Panda documents at https://pandas.pydata.org/pandas-docs/